is_student = True
print(is_student)
pass

is_student = True
is_vypusknik = False
print(is_vypusknik)

'--------------------------------'
#самое главное что исп с типом бул это выражения  
x = 10
y = 10
print(x == y)#сравнение в пайтон делается при мощи оператора ==
#результатом вывода будет тип bool(True or False)
#введем переменную

#is_equal = x == y
print(is_uqual)
pass

'для того чтобы проверить не равно, используется оператор !='
'''
== равно 
!= не равно
> больше
< меньше
>= больше либо равно 
<= меньше либо равно 
'''

#протестим все и посмотрим что выведет 
x = 10
y = 10
print( x == y)
print(x != y)
print(x > y)
print(x <= y)

pass
'---------------------------'

#допустим х=1 и надо проверить, что он меньше и больше -2
x = 1
#TODO пишем сами

pass


'''также если у вас есть проблемы с логикой, то чтобы глубже погрузиться в программировние, то стоит подучить логику, и прочесть например такую книгу, как "Учебник логики" Челпанов(необязательно)'''
















