"""в пайтоне переменная- это своего рода контейнер, который вы исп для хранения значения. это может быть числом текстом, или более сложным типами данных"""
"""после того как вы сохр значение в переменную, вы можете пользоваться значением этой переменной позже в вашей проге"""

name = 'fedya' #переменным лучше давать осмысл имена, так как код придется много раз, и в будущем можно будет запутаться
print(name)

pass
#в обыч матеше мы исп = для того что бы проверить на равенство, то в пайтон мы исп его как знак присвоения
name = 'fedya'
age = 17
print(name, age)

pass
#также можно писать переменные по другому, в одну строку через запятую
name, age = 'fedya', 17
print(name, age)

pass
#переменным можно присваивать другие переменные
name = 'fedya'
other_name = name
print(other_name)

pass
'''------------------------------------------------------'''
#допустим что x=3, y=4
x = 3
y = 4
#нам нужно чтобы в перемен y оказалась значение пермен x, и наоборот 
x, y = y, x
print(x, y)

'''----------------------------------------------------------'''
"""в пайтоне есть встроенная функций тайп, которая передает в терминал тип переменной"""
popa = 1
print(type(popa)
pass
popa = 'privet'
print(type(popa)

'-----------------------------------------------------'












