напиши функцию которая будет будет принимать переменную s и искать площадь прямоугольника
---плоащдь прямоугл = a*b---

def -название-():
  return -формула-

s = -название функции(-циферка внутри-)
print(s)


напиши функцию которая будет проверять состояние погоды( дождь ветер солнечно пасмурно)

wheather_type = 'дождь'
def -название функции-():
  if wheather_type == 'ветер':
    return wheather_type
  if fgdgdfgdf:
    return
  if gdfgdfgdf:
    return


s = -название функции- ("состояние погоды")
print(s)
